tests/suite-1000-millis-sleep-test/9000-conc-300/ab_report.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.0.14 (be patient)


Server Software:        WEBrick/1.3.1
Server Hostname:        10.0.0.14
Server Port:            80

Document Path:          /sleep/1000
Document Length:        27 bytes

Concurrency Level:      300
Time taken for tests:   113.253 seconds
Complete requests:      9000
Failed requests:        67
   (Connect: 0, Receive: 0, Length: 67, Exceptions: 0)
Non-2xx responses:      67
Keep-Alive requests:    9000
Total transferred:      3254315 bytes
HTML transferred:       245680 bytes
Requests per second:    79.47 [#/sec] (mean)
Time per request:       3775.085 [ms] (mean)
Time per request:       12.584 [ms] (mean, across all concurrent requests)
Transfer rate:          28.06 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.0      0       8
Processing:  1124 3575 2677.4   2990  103868
Waiting:     1124 3575 2677.4   2990  103868
Total:       1129 3575 2677.4   2990  103868

Percentage of the requests served within a certain time (ms)
  50%   2990
  66%   3250
  75%   3520
  80%   3772
  90%   5231
  95%   7754
  98%  11221
  99%  15134
 100%  103868 (longest request)